comparison/shockTube/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField uniform 1;//nonuniform List<scalar>
/*
100
(
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
303975
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
101325
)
;
*/

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    left
    {
      type            empty;//cyclic;
    }
    right
    {
      type            empty;//cyclic;
    }      
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
