comparison/shockTube/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (10 0 0)
    (10 10 0)
    (0 10 0)
    (0 0 1)
    (10 0 1)
    (10 10 1)
    (0 10 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet 
    {
      faces ((0 4 7 3));
      type cyclic;
      neighbourPatch outlet;
    }
    outlet 
    {
      faces ((2 6 5 1));
      type cyclic;
      neighbourPatch inlet;
    }
    bottom 
    {
      faces ((1 5 4 0));
      type cyclic;
      neighbourPatch top;
    }
    top 
    {
      faces ((3 7 6 2));
      type cyclic;
      neighbourPatch bottom;
    }
    left
    {
      faces  ((0 3 2 1));
      type empty;//cyclic;
      //neighbourPatch right;
    }
    right
    {
      faces ((4 5 6 7));
      type empty;//cyclic;
      //neighbourPatch left;
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
